posts/scotland-log.org
#+title: scotland log
#+title_extra:
#+post_type: post
#+filetags:
#+rss_title:
#+draft: t
#+pubdate: <2024-06-21>

# nb: draft status until I add pics here

I traveled with a group of 5 to Scotland March 22nd - 30th 2024. We made a triangle across
the top half of the island, going from Edinburgh -> Oban -> Inverness -> Edinburgh.

This is an informal dump of the details. Much of the group had not met
beforehand, but we all got on rather well and were both "down for whatever" and
"committed to the bit".

* Observations

The pastry game is insane in the UK, I started most mornings with a hunt for a
croissant and espresso, often trying other things like tarts or french fancies
along the way.

Lack of central air in most buildings and places we stayed - instead, there are
just heaters for if it gets too cold, and people open their windows if it gets
too hot.

(In Edinburgh and Inverness) coffee shop hours are about 8-3pm. after that they
all close and all the pubs open, the street sort of transforms.

The farther north you go, the thicker the accent.

If using cash, you'll be dealing with more coins than you're used to as an
American - there are £1 and £2 coins.

Every stray cat we saw was very friendly and cuddly.

The weather tried to kill us, it was cold and windy and death. Before the trip I
was debating a hoodie, so glad I took my jacket.

Trains rock - we didn't rent a car, and seeing how small the roads are here I
don't regret that at all.

Hostels aren't as social as you might imagine.

I definitely felt like an "American" over there (in slight contrast with
"Gringo" when traveling in Mexico).

"Lemonade" in the UK is 7-up or sprite

* Activity log

** The players

Nathan (LAD, 30) - Myself. Eepy walker, quickly in pursuit of hot drinks and pastries

Anna (LASS, 23) - Load-bearing member, initiator, the trip wouldn't have happened without her

Peters (LAD, 23?) - Considerate person, small talker, sometimes easily skeeved

Thomas (LAD, 23?) - Lanky cheeky fellow. Does not know how to stop infodumping (a good thing)

Adam (LAD, 27) - Chill dude. Prone to dropping verses, does not use syntax highlighting

** Friday, March 22nd (Edinburgh)

ARRIVAL

- Anna arrives ahead of the group by about 6 hours, walks around, has seen all
  EdinBRUH has to offer
- Adam and Thomas arrive around noon
- Peters and I have some flight issues, and join the gang around 5:30pm
- Realize I don't have working data (and it turns out neither do two other
  members of the party)
- Settle into the hostel
- Walk about, hit up a jazz club and listen to some live music

** Saturday, March 23nd (Edinburgh)

WALKIES DAY NUMBER ONE

- Discover the hostel has a nice food menu, and that coffee isn't really a thing
  here (only espresso)
- Secure prepaid sim card, shoutout to the local vendor who made it seamless
    - Peters discovers his phone was not unlocked for international sim usage
- Castle was booked for the day (no cannon 😩), went to bookstore and museum
- Got sandwiches and went up for a hike to prince's seat in the middle of town
    - Most of the gang ate their sandwiches on the way up
    - A very steep climb with a very pretty view
    - Extremely windy at the top
      todo here: pics
- Got semi-lost on the way back and got spooked by rain potential, I almost took
  the bus but in the end we all swaggered onward
- Ate dinner somewhere
- Ended up back at hostel
  - listened to a lady sing the 500 miles song while playing her guitar
  - Played chess and "shit head" with 2 decks until sleepy time

** Sunday, March 24nd (Oban)

LOOK MA, THERE'S WATER HERE

/nb: Oban is pronounced "oh-bin"/

- Breakfast at Hostel
    - American ponderances about the nuance of oatmeal vs porridge
- Take the train to Oban
- Get settled in airbnb (start laundry)
- Checkout the local gift shop, get some trinkets
- Walk up to tower in center of town, meet 2 cats, take lots of pics
  todo: pics
- Stumble over to a high end seafood place and sweatily crash for dinner
    - The group all has the same scotch, even though 2 members of the group
      knowingly aren't fans of scotch
- Stop for stellas at Aulay's
  todo: pic
- Play pico park (lots of yelling) in the airbnb until it's time to crash

** Monday, March 25nd (Oban + Kerrara)

/wherein we harass the sheep/.

- The plan: walk about Kerrara and then attend our (reserved) distillery tour
- Walk 45 min to the Kerrara ferry so we can cross and walk over there
    - The gang gets mildly chastised for not having tickets pre-purchased
    - Immediately buy return tickets upon landing, paying no heed
- See a sign that says "castle this way" and immediately pursue
- It's a wonderful scenic route with many sheep and goats to befriend
    - todo: insert pics
- Reach the castle, do parkcore
    - todo: pics
- Realize we should head back to the ferry to have a shot at making our 1:30pm tour
- Do quick walk back to the launch point, see the ferry carry peeps, looks pretty active
- Ferry captain notes as he walks by: "The next ferry is at 2pm"
- RIP distillery tour we hardly knew ye
- Kill the extra time on Kerrara hiking the other way to see the farmstore
    - farmstore is unoperated, it's the ✨honor system✨: we write down what we
      take and leave money in the changebox
    - Anna and I have the messiest tuna + crackers of our lives
- On the ferry back we meet some frenchies, and Thomas enthusiastically
  volunteers his french skills

After the walk back, we guesstimate an excursion length of 14 miles

- We visit the distillery afterwards anyway
- The owner is nice enough to chat and give us samples and the dram glasses we
  would have gotten
- Peters and Adam acquire scotch (as one does)
- Grab dinner at a bar+restaurant, make the mistake of ordering ribs
- Play pool on a really nice table there
- Chill in the AirBnB playing switch golf game until time to crash

** Tuesday, March 26th (Inverness)

- 5:00am-1:30pm train to Inverness
  - Connected through Glasgow, snacked on a "french fancy"
- Throw our luggage in lockers, kill time until airbnb checkin with bookstore
  and eating @ highlander
- Settle into airbnb, and decide to solo chill there while the group goes out
- The lads hit the malt room and have a whiskey side quest
- Get locked in the bathroom‽‽
    - The doorknob latch isn't turning with the knob
    - Anna and Thomas come to my rescue
    - We get ahold of the landlady and she KICKS OUT THE DOORKNOB
    - I get a whiskey drink for my troubles

Aside: around here we realize tomorrow is _the_ morning to sleep in whilst in
Inverness, as we have a train at 8am the day after. We come to a consensus
tonight is the night to go ham in Inverness

- We get wine and cheese tray at a site down wine and cheese place
- Walk around aimlessly, switching leaders, looking for alcohol and food
- Settle at a restaurant but the service takes forever so we end up just getting
  a bottle of wine there and eyeing the Thai place across the way
- Thai was full, collapsed into 'the white house' the waiter immediately gave us 5 shots and we had very nice dinner
- Go to highlander, catch live music and dance a bit with the locals
    - The live music was an accordian guitar duo and they were very good
    - todo: find out who it was
- Crash for the night

** Wednesday (Inverness)

- It's hungover hump day. I need pancakes
- The clock ticks by and somehow pancakes transmogrifies into a full scottish breakfast
    - Peters + Thomas did this the other day, I had some catchup to do 😤
    - todo: insert pic here
- Adam installs emacs. Will he fall down the lisp rabbithole?
    - His distro ships with emacs 27, obv we want 28, welp time to compile emacs
    - emacs 28+ is hard to install on opensuse for gccemacs (libgccjit)
    - ultimately defeated because libgccjit is not packaged for Adam's distro
    - motive for 28 lost, he installs 27 and his beard becomes a little grayer.
    - todo: insert adam pic here

Some how I've completely forgotten what we did this day. Maybe I'll get an
assist from the gang. What I do remember:

- Adam and I sleep early because there's a train in the morning
- The youngun's go out and end up going hard AF in inverness:
- They start the night at highlander
- Peters plays defence against a persistent suitor dancing into Anna
- They meet some locals (two long haired lasses) hit it off dancing
    - JK, turns out to be one long haired lass and one long haired lad
    - The lass is nice and flirty, but also smelly
- highlander closes and they wander over to the forest fox(?)
- They close out forest fox, but the locals know a place!
- On the way to the next place, they learn the destination is actually a strip club
- They're REALLY excited about getting peters a lapdance
- Peters is not interested in a lap dance, and the other 2 have SO's and are
  ready to call it a night
- They split amicably, but there's a creepy straggler, whom Peters staves off
  (shoutout Peters)

** Thursday (Edinburgh)

- Get a bunch of coffee and pastries to start the day
- Train to edinburgh, gang splits up
- Store luggage, walk around
- Visit book stores
- Eat pancakes
- Get luggage, hole up in lobby, start a puzzle
- -> check in, nap
- Wake up, learn the lads are arriving at 9:30, prep for bar
- 2x bars we aimed for were closed, we were seeking madmen, ended up at "under
  the stairs" which was still a small chill vibe
- In search of an activity, the group decides to go through the 36 questions,
  but limit the answer time to 30 seconds
- We get in our feels (which I completely missed initially), teeter totter on
  home vs dancing and decide to seek a close dancing bar
- Jam to some electronic music and then get a compliment on my kilt - quickly
  realize it's a gay bar, which is fun but also we're ready for home so we
  just dance for ~10min and then head for home

** Friday (Edinburgh)

- I get up before everyone, get my pastry + coffee fix and then start puzzling
  in the hostel lobby
- Anna departs today, goal is to puzzle till she leaves and then tbd
- There's no way we're finishing this 1000 piece puzzle before we have to leave
- JUST KIDDING WE DID IT, finished the whole thing in the nick of time to see
  Anna off to the airport tram
- The boys immediately lose each other, falling apart without Anna to bind us
- After regrouping, we stumble around looking for dinner and eventually land on
  a gordan ramsay restaurant (Bread Street)
- Pack and sleep after that, digging a new book
- We all leave for the airport in the morning

* Group References

- any word ending in -"er", followed by HEYOOOOO
- Adammmm
- I miss Sarah
- uhhhh we gotta GO
- unce unce unce unce WATER
- the song "I'm Gonna Be (500 Miles)"
- have you found your scottish wife yet?
- CAT CAT CAT KITTY CAT
- Bro don't forget your flathat
- Hey Peters could you climb this?
- Guys this card game makes me anxious
- Thomas we're leaving in 10 minutes GET UP
- Yeah, that's all you get to know buddy
- Do you think they take amex?
- That's cool, but do they have live music?
- What if we got tattoos here
- Lil Teddy
- (s)he's just like me, we're both criers
- That's not lemonade
- Actually, can I have what they're having?
-
    - Did you see the discord?
    - Did you see my text?
    - Do you have data?
-
    - Hey is there cheese on this?
    - Hey is there milk in this?
    - Hey is gelato made with dairy?
- Hey Nathan.. so what about <clojure or emacs-lisp thing here>
- This is a prime rms computing spot
- Wait you used vim???

* COMMENT Logistics

mention:
 - plane cost, how much spent on misc/food/bs, hostel + airbnb costs
 - splitwise
 - laundry
 - showers
 - adapters
 - powerbanks
 - hostel experience
 - plane experience/american vs british airlines
