scotland-log.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-06-18 Wed 16:11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0" />
<title>scotland log</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta property="og:title" content="scotland log">
<meta property="og:description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/newfeather.png">
<meta property="og:url" content="https://notes.neeasade.net/scotland-log.html">
<meta property="description" content="">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=7ca3a7d19d77e07a7aa1b75c41b6c485'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=7ca3a7d19d77e07a7aa1b75c41b6c485'>
<link rel='stylesheet' href='/assets/css/new.css?sum=8ded96c4e22d9cf406740e90fb2c41de'>
<link rel='stylesheet' href='./assets/css/new.css?sum=8ded96c4e22d9cf406740e90fb2c41de'>
<link rel='stylesheet' href='/assets/css/org.css?sum=6f5b128ae2001f1230d4fdc21163a4d6'>
<link rel='stylesheet' href='./assets/css/org.css?sum=6f5b128ae2001f1230d4fdc21163a4d6'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=fa37501051191341a7f3dc0bd53d43a5'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=fa37501051191341a7f3dc0bd53d43a5'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>../neeasade's notes</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/scotland-log.org">source</a>
</div>
<h1 class=title>scotland log</h1>
<div class="org-center">
<p>

</p>
</div>
<div class=pubinfo>
Published 2024-06-21, last edit <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/scotland-log.org">2024-12-30</a>
</div>
<hr>
<p>
I traveled with a group of 5 to Scotland March 22nd - 30th 2024. We made a triangle across
the top half of the island, going from Edinburgh -&gt; Oban -&gt; Inverness -&gt; Edinburgh.
</p>

<p>
This is an informal dump of the details. Much of the group had not met
beforehand, but we all got on rather well and were both &ldquo;down for whatever&rdquo; and
&ldquo;committed to the bit&rdquo;.
</p>
<div id="outline-container-Observations" class="outline-2">
<h2 id="Observations"><span class="section-number-2">1.</span> Observations <span class=anchor><a href="#Observations">#</a></span></h2>
<div class="outline-text-2" id="text-Observations">
<p>
The pastry game is insane in the UK, I started most mornings with a hunt for a
croissant and espresso, often trying other things like tarts or french fancies
along the way.
</p>

<p>
Lack of central air in most buildings and places we stayed - instead, there are
just heaters for if it gets too cold, and people open their windows if it gets
too hot.
</p>

<p>
(In Edinburgh and Inverness) coffee shop hours are about 8-3pm. after that they
all close and all the pubs open, the street sort of transforms.
</p>

<p>
The farther north you go, the thicker the accent.
</p>

<p>
If using cash, you&rsquo;ll be dealing with more coins than you&rsquo;re used to as an
American - there are £1 and £2 coins.
</p>

<p>
Every stray cat we saw was very friendly and cuddly.
</p>

<p>
The weather tried to kill us, it was cold and windy and death. Before the trip I
was debating a hoodie, so glad I took my jacket.
</p>

<p>
Trains rock - we didn&rsquo;t rent a car, and seeing how small the roads are here I
don&rsquo;t regret that at all.
</p>

<p>
Hostels aren&rsquo;t as social as you might imagine.
</p>

<p>
I definitely felt like an &ldquo;American&rdquo; over there (in slight contrast with
&ldquo;Gringo&rdquo; when traveling in Mexico).
</p>

<p>
&ldquo;Lemonade&rdquo; in the UK is 7-up or sprite
</p>
</div>
</div>
<div id="outline-container-Activity-log" class="outline-2">
<h2 id="Activity-log"><span class="section-number-2">2.</span> Activity log <span class=anchor><a href="#Activity-log">#</a></span></h2>
<div class="outline-text-2" id="text-Activity-log">
</div>
<div id="outline-container-The-players" class="outline-3">
<h3 id="The-players"><span class="section-number-3">2.1.</span> The players <span class=anchor><a href="#The-players">#</a></span></h3>
<div class="outline-text-3" id="text-The-players">
<p>
Nathan (LAD, 30) - Myself. Eepy walker, quickly in pursuit of hot drinks and pastries
</p>

<p>
Anna (LASS, 23) - Load-bearing member, initiator, the trip wouldn&rsquo;t have happened without her
</p>

<p>
Peters (LAD, 23?) - Considerate person, small talker, sometimes easily skeeved
</p>

<p>
Thomas (LAD, 23?) - Lanky cheeky fellow. Does not know how to stop infodumping (a good thing)
</p>

<p>
Adam (LAD, 27) - Chill dude. Prone to dropping verses, does not use syntax highlighting
</p>
</div>
</div>
<div id="outline-container-Friday,-March-22nd-(Edinburgh)" class="outline-3">
<h3 id="Friday,-March-22nd-(Edinburgh)"><span class="section-number-3">2.2.</span> Friday, March 22nd (Edinburgh) <span class=anchor><a href="#Friday,-March-22nd-(Edinburgh)">#</a></span></h3>
<div class="outline-text-3" id="text-Friday,-March-22nd-(Edinburgh)">
<p>
ARRIVAL
</p>

<ul class="org-ul">
<li>Anna arrives ahead of the group by about 6 hours, walks around, has seen all
EdinBRUH has to offer</li>
<li>Adam and Thomas arrive around noon</li>
<li>Peters and I have some flight issues, and join the gang around 5:30pm</li>
<li>Realize I don&rsquo;t have working data (and it turns out neither do two other
members of the party)</li>
<li>Settle into the hostel</li>
<li>Walk about, hit up a jazz club and listen to some live music</li>
</ul>
</div>
</div>
<div id="outline-container-Saturday,-March-23nd-(Edinburgh)" class="outline-3">
<h3 id="Saturday,-March-23nd-(Edinburgh)"><span class="section-number-3">2.3.</span> Saturday, March 23nd (Edinburgh) <span class=anchor><a href="#Saturday,-March-23nd-(Edinburgh)">#</a></span></h3>
<div class="outline-text-3" id="text-Saturday,-March-23nd-(Edinburgh)">
<p>
WALKIES DAY NUMBER ONE
</p>

<ul class="org-ul">
<li>Discover the hostel has a nice food menu, and that coffee isn&rsquo;t really a thing
here (only espresso)</li>
<li>Secure prepaid sim card, shoutout to the local vendor who made it seamless
<ul class="org-ul">
<li>Peters discovers his phone was not unlocked for international sim usage</li>
</ul></li>
<li>Castle was booked for the day (no cannon 😩), went to bookstore and museum</li>
<li>Got sandwiches and went up for a hike to prince&rsquo;s seat in the middle of town
<ul class="org-ul">
<li>Most of the gang ate their sandwiches on the way up</li>
<li>A very steep climb with a very pretty view</li>
<li>Extremely windy at the top
todo here: pics</li>
</ul></li>
<li>Got semi-lost on the way back and got spooked by rain potential, I almost took
the bus but in the end we all swaggered onward</li>
<li>Ate dinner somewhere</li>
<li>Ended up back at hostel
<ul class="org-ul">
<li>listened to a lady sing the 500 miles song while playing her guitar</li>
<li>Played chess and &ldquo;shit head&rdquo; with 2 decks until sleepy time</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-Sunday,-March-24nd-(Oban)" class="outline-3">
<h3 id="Sunday,-March-24nd-(Oban)"><span class="section-number-3">2.4.</span> Sunday, March 24nd (Oban) <span class=anchor><a href="#Sunday,-March-24nd-(Oban)">#</a></span></h3>
<div class="outline-text-3" id="text-Sunday,-March-24nd-(Oban)">
<p>
LOOK MA, THERE&rsquo;S WATER HERE
</p>

<p>
<i>nb: Oban is pronounced &ldquo;oh-bin&rdquo;</i>
</p>

<ul class="org-ul">
<li>Breakfast at Hostel
<ul class="org-ul">
<li>American ponderances about the nuance of oatmeal vs porridge</li>
</ul></li>
<li>Take the train to Oban</li>
<li>Get settled in airbnb (start laundry)</li>
<li>Checkout the local gift shop, get some trinkets</li>
<li>Walk up to tower in center of town, meet 2 cats, take lots of pics
todo: pics</li>
<li>Stumble over to a high end seafood place and sweatily crash for dinner
<ul class="org-ul">
<li>The group all has the same scotch, even though 2 members of the group
knowingly aren&rsquo;t fans of scotch</li>
</ul></li>
<li>Stop for stellas at Aulay&rsquo;s
todo: pic</li>
<li>Play pico park (lots of yelling) in the airbnb until it&rsquo;s time to crash</li>
</ul>
</div>
</div>
<div id="outline-container-Monday,-March-25nd-(Oban-+-Kerrara)" class="outline-3">
<h3 id="Monday,-March-25nd-(Oban-+-Kerrara)"><span class="section-number-3">2.5.</span> Monday, March 25nd (Oban + Kerrara) <span class=anchor><a href="#Monday,-March-25nd-(Oban-+-Kerrara)">#</a></span></h3>
<div class="outline-text-3" id="text-Monday,-March-25nd-(Oban-+-Kerrara)">
<p>
<i>wherein we harass the sheep</i>.
</p>

<ul class="org-ul">
<li>The plan: walk about Kerrara and then attend our (reserved) distillery tour</li>
<li>Walk 45 min to the Kerrara ferry so we can cross and walk over there
<ul class="org-ul">
<li>The gang gets mildly chastised for not having tickets pre-purchased</li>
<li>Immediately buy return tickets upon landing, paying no heed</li>
</ul></li>
<li>See a sign that says &ldquo;castle this way&rdquo; and immediately pursue</li>
<li>It&rsquo;s a wonderful scenic route with many sheep and goats to befriend
<ul class="org-ul">
<li>todo: insert pics</li>
</ul></li>
<li>Reach the castle, do parkcore
<ul class="org-ul">
<li>todo: pics</li>
</ul></li>
<li>Realize we should head back to the ferry to have a shot at making our 1:30pm tour</li>
<li>Do quick walk back to the launch point, see the ferry carry peeps, looks pretty active</li>
<li>Ferry captain notes as he walks by: &ldquo;The next ferry is at 2pm&rdquo;</li>
<li>RIP distillery tour we hardly knew ye</li>
<li>Kill the extra time on Kerrara hiking the other way to see the farmstore
<ul class="org-ul">
<li>farmstore is unoperated, it&rsquo;s the ✨honor system✨: we write down what we
take and leave money in the changebox</li>
<li>Anna and I have the messiest tuna + crackers of our lives</li>
</ul></li>
<li>On the ferry back we meet some frenchies, and Thomas enthusiastically
volunteers his french skills</li>
</ul>

<p>
After the walk back, we guesstimate an excursion length of 14 miles
</p>

<ul class="org-ul">
<li>We visit the distillery afterwards anyway</li>
<li>The owner is nice enough to chat and give us samples and the dram glasses we
would have gotten</li>
<li>Peters and Adam acquire scotch (as one does)</li>
<li>Grab dinner at a bar+restaurant, make the mistake of ordering ribs</li>
<li>Play pool on a really nice table there</li>
<li>Chill in the AirBnB playing switch golf game until time to crash</li>
</ul>
</div>
</div>
<div id="outline-container-Tuesday,-March-26th-(Inverness)" class="outline-3">
<h3 id="Tuesday,-March-26th-(Inverness)"><span class="section-number-3">2.6.</span> Tuesday, March 26th (Inverness) <span class=anchor><a href="#Tuesday,-March-26th-(Inverness)">#</a></span></h3>
<div class="outline-text-3" id="text-Tuesday,-March-26th-(Inverness)">
<ul class="org-ul">
<li>5:00am-1:30pm train to Inverness
<ul class="org-ul">
<li>Connected through Glasgow, snacked on a &ldquo;french fancy&rdquo;</li>
</ul></li>
<li>Throw our luggage in lockers, kill time until airbnb checkin with bookstore
and eating @ highlander</li>
<li>Settle into airbnb, and decide to solo chill there while the group goes out</li>
<li>The lads hit the malt room and have a whiskey side quest</li>
<li>Get locked in the bathroom‽‽
<ul class="org-ul">
<li>The doorknob latch isn&rsquo;t turning with the knob</li>
<li>Anna and Thomas come to my rescue</li>
<li>We get ahold of the landlady and she KICKS OUT THE DOORKNOB</li>
<li>I get a whiskey drink for my troubles</li>
</ul></li>
</ul>

<p>
Aside: around here we realize tomorrow is <span class="underline">the</span> morning to sleep in whilst in
Inverness, as we have a train at 8am the day after. We come to a consensus
tonight is the night to go ham in Inverness
</p>

<ul class="org-ul">
<li>We get wine and cheese tray at a site down wine and cheese place</li>
<li>Walk around aimlessly, switching leaders, looking for alcohol and food</li>
<li>Settle at a restaurant but the service takes forever so we end up just getting
a bottle of wine there and eyeing the Thai place across the way</li>
<li>Thai was full, collapsed into &rsquo;the white house&rsquo; the waiter immediately gave us 5 shots and we had very nice dinner</li>
<li>Go to highlander, catch live music and dance a bit with the locals
<ul class="org-ul">
<li>The live music was an accordian guitar duo and they were very good</li>
<li>todo: find out who it was</li>
</ul></li>
<li>Crash for the night</li>
</ul>
</div>
</div>
<div id="outline-container-Wednesday-(Inverness)" class="outline-3">
<h3 id="Wednesday-(Inverness)"><span class="section-number-3">2.7.</span> Wednesday (Inverness) <span class=anchor><a href="#Wednesday-(Inverness)">#</a></span></h3>
<div class="outline-text-3" id="text-Wednesday-(Inverness)">
<ul class="org-ul">
<li>It&rsquo;s hungover hump day. I need pancakes</li>
<li>The clock ticks by and somehow pancakes transmogrifies into a full scottish breakfast
<ul class="org-ul">
<li>Peters + Thomas did this the other day, I had some catchup to do 😤</li>
<li>todo: insert pic here</li>
</ul></li>
<li>Adam installs emacs. Will he fall down the lisp rabbithole?
<ul class="org-ul">
<li>His distro ships with emacs 27, obv we want 28, welp time to compile emacs</li>
<li>emacs 28+ is hard to install on opensuse for gccemacs (libgccjit)</li>
<li>ultimately defeated because libgccjit is not packaged for Adam&rsquo;s distro</li>
<li>motive for 28 lost, he installs 27 and his beard becomes a little grayer.</li>
<li>todo: insert adam pic here</li>
</ul></li>
</ul>

<p>
Some how I&rsquo;ve completely forgotten what we did this day. Maybe I&rsquo;ll get an
assist from the gang. What I do remember:
</p>

<ul class="org-ul">
<li>Adam and I sleep early because there&rsquo;s a train in the morning</li>
<li>The youngun&rsquo;s go out and end up going hard AF in inverness:</li>
<li>They start the night at highlander</li>
<li>Peters plays defence against a persistent suitor dancing into Anna</li>
<li>They meet some locals (two long haired lasses) hit it off dancing
<ul class="org-ul">
<li>JK, turns out to be one long haired lass and one long haired lad</li>
<li>The lass is nice and flirty, but also smelly</li>
</ul></li>
<li>highlander closes and they wander over to the forest fox(?)</li>
<li>They close out forest fox, but the locals know a place!</li>
<li>On the way to the next place, they learn the destination is actually a strip club</li>
<li>They&rsquo;re REALLY excited about getting peters a lapdance</li>
<li>Peters is not interested in a lap dance, and the other 2 have SO&rsquo;s and are
ready to call it a night</li>
<li>They split amicably, but there&rsquo;s a creepy straggler, whom Peters staves off
(shoutout Peters)</li>
</ul>
</div>
</div>
<div id="outline-container-Thursday-(Edinburgh)" class="outline-3">
<h3 id="Thursday-(Edinburgh)"><span class="section-number-3">2.8.</span> Thursday (Edinburgh) <span class=anchor><a href="#Thursday-(Edinburgh)">#</a></span></h3>
<div class="outline-text-3" id="text-Thursday-(Edinburgh)">
<ul class="org-ul">
<li>Get a bunch of coffee and pastries to start the day</li>
<li>Train to edinburgh, gang splits up</li>
<li>Store luggage, walk around</li>
<li>Visit book stores</li>
<li>Eat pancakes</li>
<li>Get luggage, hole up in lobby, start a puzzle</li>
<li>-&gt; check in, nap</li>
<li>Wake up, learn the lads are arriving at 9:30, prep for bar</li>
<li>2x bars we aimed for were closed, we were seeking madmen, ended up at &ldquo;under
the stairs&rdquo; which was still a small chill vibe</li>
<li>In search of an activity, the group decides to go through the 36 questions,
but limit the answer time to 30 seconds</li>
<li>We get in our feels (which I completely missed initially), teeter totter on
home vs dancing and decide to seek a close dancing bar</li>
<li>Jam to some electronic music and then get a compliment on my kilt - quickly
realize it&rsquo;s a gay bar, which is fun but also we&rsquo;re ready for home so we
just dance for ~10min and then head for home</li>
</ul>
</div>
</div>
<div id="outline-container-Friday-(Edinburgh)" class="outline-3">
<h3 id="Friday-(Edinburgh)"><span class="section-number-3">2.9.</span> Friday (Edinburgh) <span class=anchor><a href="#Friday-(Edinburgh)">#</a></span></h3>
<div class="outline-text-3" id="text-Friday-(Edinburgh)">
<ul class="org-ul">
<li>I get up before everyone, get my pastry + coffee fix and then start puzzling
in the hostel lobby</li>
<li>Anna departs today, goal is to puzzle till she leaves and then tbd</li>
<li>There&rsquo;s no way we&rsquo;re finishing this 1000 piece puzzle before we have to leave</li>
<li>JUST KIDDING WE DID IT, finished the whole thing in the nick of time to see
Anna off to the airport tram</li>
<li>The boys immediately lose each other, falling apart without Anna to bind us</li>
<li>After regrouping, we stumble around looking for dinner and eventually land on
a gordan ramsay restaurant (Bread Street)</li>
<li>Pack and sleep after that, digging a new book</li>
<li>We all leave for the airport in the morning</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-Group-References" class="outline-2">
<h2 id="Group-References"><span class="section-number-2">3.</span> Group References <span class=anchor><a href="#Group-References">#</a></span></h2>
<div class="outline-text-2" id="text-Group-References">
<ul class="org-ul">
<li>any word ending in -&ldquo;er&rdquo;, followed by HEYOOOOO</li>
<li>Adammmm</li>
<li>I miss Sarah</li>
<li>uhhhh we gotta GO</li>
<li>unce unce unce unce WATER</li>
<li>the song &ldquo;I&rsquo;m Gonna Be (500 Miles)&rdquo;</li>
<li>have you found your scottish wife yet?</li>
<li>CAT CAT CAT KITTY CAT</li>
<li>Bro don&rsquo;t forget your flathat</li>
<li>Hey Peters could you climb this?</li>
<li>Guys this card game makes me anxious</li>
<li>Thomas we&rsquo;re leaving in 10 minutes GET UP</li>
<li>Yeah, that&rsquo;s all you get to know buddy</li>
<li>Do you think they take amex?</li>
<li>That&rsquo;s cool, but do they have live music?</li>
<li>What if we got tattoos here</li>
<li>Lil Teddy</li>
<li>(s)he&rsquo;s just like me, we&rsquo;re both criers</li>
<li>That&rsquo;s not lemonade</li>
<li>Actually, can I have what they&rsquo;re having?</li>
<li><ul class="org-ul">
<li>Did you see the discord?</li>
<li>Did you see my text?</li>
<li>Do you have data?</li>
</ul></li>
<li><ul class="org-ul">
<li>Hey is there cheese on this?</li>
<li>Hey is there milk in this?</li>
<li>Hey is gelato made with dairy?</li>
</ul></li>
<li>Hey Nathan.. so what about &lt;clojure or emacs-lisp thing here&gt;</li>
<li>This is a prime rms computing spot</li>
<li>Wait you used vim???</li>
</ul>
</div>
</div>
</div>
</body>
</html>
